Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkTagAttributes.TagTextRotation Enumeration
 The mark tag text rotation values.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum TagTextRotation
Public Enumeration TagTextRotation
Members
Member name | Value | Description
AlwaysRotate | 1 |  Always rotate.
AlwaysHorizontal | 2 |  Always horizontal.
DoNotRotateVertically | 3 |  Do not rotate vertically.
AlwaysOrthogonal | 4 |  Always orthogonal.
See Also
Reference
Tekla.Structures.Drawing Namespace